<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="abstyle.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000" leftmargin="0" topmargin="0">
<object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=5,0,0,0" width="550" height="40">
  <param name=movie value="pics/derselement/dershedefi.swf">
  <param name=quality value=high>
  <embed src="pics/derselement/dershedefi.swf" quality=high pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" width="550" height="40">
  </embed> 
</object>
<table width="100%" border="0" cellpadding="15" cellspacing="0">
  <tr> 
    <td width="1" height="255" valign="top"> 
      <p><img src="pics/derselement/arabirim_hedef.jpg" width="182" height="158"></p>
      <p>&nbsp;</p>
    </td>
    <td width="100%" height="255" valign="top" bgcolor="#FFFFFF"> 
      <p class="content"><span class="altbaslik">Bu Dersi Tamamlad&#305;ktan Sonra</span></p>
      <p class="content"><u>Web Tasar&#305;m Dersi</u> amac&#305; ki&#351;isel ve   kurumsal siteler yapmak isteyenlere y&ouml;nelik g&ouml;rsel   tasar&#305;m   teknikleriyle web tekniklerinin etkin bir &#351;ekilde kullan&#305;lmas&#305;d&#305;r.     &#350;irketlerin reklam ama&ccedil;l&#305; Online ilanlar&#305;n&#305;, banner ad&#305; verilen internet     reklamlar&#305;n&#305;, blog, portal gibi sayfa tasar&#305;mlar&#305;n&#305; d&uuml;zenlemek   isteyen herkesin   kat&#305;larak kariyerinde internet ileti&#351;imi konusunda   katk&#305; sa&#287;layaca&#287;&#305; bir e&#287;itim   program&#305;d&#305;r. Bu e&#287;itimle web ajanslar&#305;nda   iyi bir kariyer sa&#287;layabilir ya da   kendi i&#351;inizin sahibi olarak da   &ccedil;al&#305;&#351;ma hayat&#305;n&#305;za at&#305;labilirsiniz. <br>
      </p>
      </td>
  </tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="15">
  <tr>
    <td>
<p class="content"><span class="altbaslik">K&#305;sacas&#305;</span><br>
Kendi internet sitesini olu&#351;turmak, bili&#351;im   d&uuml;nyas&#305;nda ve   Reklam ajanslar&#305;nda Webmaster olarak &ccedil;al&#305;&#351;mak   isteyenler, Web Tasar&#305;m Yaz&#305;l&#305;m uzman&#305; olmak isteyen, <br>
Web Tasar&#305;m &#350;irketlerin Web Tasar&#305;m b&ouml;l&uuml;mlerinde &ccedil;al&#305;&#351;acaklar. . . </p>
      <p><span class="altbaslik">Konuyla ilgili K&#305;saltmalar ve Temel Simgeler</span></p>
      <p>Photoshop ara&ccedil;lar&#305;n&#305;n tan&#305;t&#305;lmas&#305;,   kullan&#305;m&#305; ve &ouml;rnek &ccedil;al&#305;&#351;malar, Web   sitesinin ana yap&#305;s&#305;n&#305;n olu&#351;turulmas&#305;,   dilimlenmesi ve Link verilmesi,   buttonlar, arka plan desenlerinin olu&#351;turulmas&#305;,   ve kullan&#305;lacak   foto&#287;raflar&#305;n web ortam&#305;na haz&#305;rlanmas&#305;. Photoshop' ta yap&#305;lan     &ccedil;al&#305;&#351;malar&#305;n web i&ccedil;in kay&#305;t edilmesi, Bannerlar, Buttonlar, Hareketli   Gif'ler   olu&#351;turma<br>
Daha geli&#351;mi&#351; ve   profesyonel tasar&#305;mlar yapmak i&ccedil;in yard&#305;mc&#305;   programlar&#305;n dreamweaver ile   etkile&#351;imi hakk&#305;nda uygulamal&#305; e&#287;itimler.   Site tan&#305;mlamak, Sayfa ayarlar&#305;n&#305;n   yap&#305;lmas&#305;, Linkler, sayfa   g&ouml;r&uuml;n&uuml;m&uuml;ne y&ouml;nelik esnek ve kullan&#305;&#351;l&#305; stil   &#351;ablonlar&#305;n&#305;n   olu&#351;turulmas&#305; ve kullan&#305;m&#305;. Tablolar, Resimler ve Layerlar' &#305;n     anlat&#305;lmas&#305;, Davran&#305;&#351;lar ve Olaylar, Flash Eklemek,&ouml;rnek uygulamalar   yap&#305;lmas&#305;,   &Ccedil;er&ccedil;eve, &#350;ablon ve K&uuml;t&uuml;phane kullan&#305;m&#305;, H&#305;zl&#305; ula&#351;&#305;m   men&uuml;s&uuml;, &Uuml;zerine gelince   de&#287;i&#351;en button olu&#351;turmak, Formlar, Linklere   veya sayfaya ba&#287;l&#305; mesaj veya   pencere a&ccedil;&#305;lmas&#305;, Durum &ccedil;ubu&#287;unda &ccedil;&#305;kan   mesajlar olu&#351;turma, De&#287;i&#351;en resimler   olu&#351;turma, Dreamweaver   i&ccedil;erisinden FTP   yapma.<br>
        <span class="content"><br>
        </span></p>
    </td>
  </tr>
</table>
</body>
</html>
