<html>
<head>
<title></title>
<meta http-equiv="Content-Type" content="text/html; charset=8859-9">
<link rel="stylesheet" href="abstyle.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000" leftmargin="0" topmargin="0">
<table width="100%" border="0" cellpadding="15" cellspacing="0">
  <tr> 
    <td height="522" valign="top" >
<p class="content"><span class="baslik"</span> <span class="r"></span></p>
      <p class="content">Kullan&#305;c&#305; kontrolleri bir i&ccedil;eri&#287;in birden fazla sayfada kullan&#305;lmas&#305;na olanak sa&#287;lar.Bir web  sayfas&#305;na  eklenerek  i&ccedil;erik  sa&#287;lar  ve  i&ccedil;eri&#287;in  y&ouml;netiminin  tek  bir  yerden  yap&#305;lmas&#305;n&#305; sa&#287;lar.Web  kullan&#305;c&#305;  kontrolleri  sunucu  tarafl&#305;  &ccedil;al&#305;&#351;an  bir form i&ccedil;ermezler.  Bu  nedenle &ccedil;al&#305;&#351;mak i&ccedil;in mutlaka sunucu tarafl&#305; &ccedil;al&#305;&#351;an bir web formun i&ccedil;ine eklenmelidir.ASP.NET yeni  s&uuml;r&uuml;mlerinde MasterPagekullan&#305;m&#305;  ile  kullan&#305;c&#305;  kontrollerinin kullan&#305;m&#305; azalm&#305;&#351;t&#305;r (MasterPage konusuna ilerleyen mod&uuml;llerde yer verilmektedir).Web kullan&#305;c&#305; kontrollerinin dosya uzant&#305;s&#305; ascx&rsquo;dir. Web kullan&#305;c&#305; kontrolleri normal ASP.NET  sayfalar&#305;  gibi  programlanabilir  ve  kodlar&#305;  farkl&#305;  bir  dosyada  tutulabilir.  Kod sayfas&#305;n&#305;n uzant&#305;s&#305; da ASP.NET sayfalar&#305;na benzer &#351;ekilde .ascx.cs&rsquo;dir.      
      <p class="content">Web  kullan&#305;c&#305;  kontrol&uuml; kodlar&#305;,  klasik  ASP.NET sayfalar&#305;n&#305;n  kodlar&#305;na benzerlik g&ouml;stermektedir.  .aspxdosyalar&#305; @Pagedirektifi  ile  ba&#351;larken  .ascxdosyalar&#305; @Controldirektifi ile ba&#351;lamakta ve kontrol ayarlar&#305;n&#305;nbir k&#305;sm&#305; bu alanda ger&ccedil;ekle&#351;tirilebilmektedir.      
      <p class="content">Web kullan&#305;c&#305; kontrolleri haz&#305;rland&#305;ktan sonra uygulama &ccedil;al&#305;&#351;t&#305;r&#305;lacak olursa ekrana kullan&#305;c&#305; kontrol&uuml; yerine uygulama a&ccedil;&#305;l&#305;&#351; sayfas&#305; gelir. &Ccedil;&uuml;nk&uuml; web kullan&#305;c&#305; kontrolleri tek ba&#351;lar&#305;na &ccedil;al&#305;&#351;mazlar,mutlaka bir sunucu tarafl&#305; &ccedil;al&#305;&#351;an form i&ccedil;ine eklenmelidirler.Programlama  yaz&#305;l&#305;m&#305;  haz&#305;rlanan  web  kullan&#305;c&#305;  kontrollerinin  do&#287;rudan SolutionExplorerpanelinden  sayfaya  s&uuml;r&uuml;klenerek  eklenmesine  izin  verir.  Web  kullan&#305;c&#305;  kontrol&uuml; s&uuml;r&uuml;klendikten sonra sayfada do&#287;rudan g&ouml;r&uuml;nt&uuml;lenecektir.      
      <p class="content">
      
      <p class="yonelt" align="left">&nbsp;</p>
      <p class="imgdesc" align="left">&nbsp;</p>
    </td>
  </tr>
</table>
</body>
</html>
