<html>
<head>
<title></title>
<meta http-equiv="Content-Type" content="text/html; charset=8859-9">
<link rel="stylesheet" href="abstyle.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000" leftmargin="0" topmargin="0">
<table width="100%" border="0" cellpadding="15" cellspacing="0">
  <tr> 
    <td height="328" valign="top" width="220"> 
      <p>&nbsp;<img src="pics/derselement/1_7PoIkU7tSWvq-cCooWAZSw.png" width="318" height="159"></p>
    </td>
    <td valign="top" width="100%" height="328"> 
      <p class="content"><span class="baslik">1.9 TEMALARI KULLANMA</span></p>
      <p class="content">ASP.NET Temalar&#305;Bir web sayfan&#305;n i&#351;levselli&#287;i siteyi ziyaret eden kullan&#305;c&#305; say&#305;s&#305; ile do&#287;ru orant&#305;l&#305;d&#305;r. Bu nedenle sitenin g&ouml;r&uuml;n&uuml;m&uuml; b&uuml;y&uuml;k &ouml;nem ta&#351;&#305;maktad&#305;r. Sitenin g&ouml;r&uuml;n&uuml;m&uuml;n&uuml;n iyi olmas&#305;n&#305;n yan&#305;nda g&ouml;r&uuml;n&uuml;m&uuml;n ara ara de&#287;i&#351;tirilmesi siteyi ziyaret eden kullan&#305;c&#305; say&#305;s&#305;n&#305; olumlu y&ouml;nde etkileyecektir.Sayfa say&#305;s&#305; az olan bir sitenin g&ouml;r&uuml;n&uuml;m&uuml;n&uuml; de&#287;i&#351;tirmek pek sorun te&#351;kil etmeyebilir, ancak sayfa say&#305;s&#305; artt&#305;k&ccedil;abir sitede g&ouml;r&uuml;n&uuml;m&uuml; de&#287;i&#351;tirmek olduk&ccedil;a b&uuml;y&uuml;k problemlere yol a&ccedil;acakt&#305;r.  Bu  durum CSS  (Cascading  Style  Sheet)ile  giderilse  de  ASP.NET&rsquo;te  yeterli olmamaktad&#305;r.ASP.NET&rsquo;te genel olarak bir sitenin g&ouml;r&uuml;n&uuml;m&uuml;n&uuml;n nas&#305;l olaca&#287;&#305;n&#305; belirleyen yap&#305;lar yanitemalar  geli&#351;tirilmi&#351;tir.  Temalar  web  sitesindeki  t&uuml;m  sayfalara web.config dosyas&#305;na yaz&#305;lacak kodlarla uygulanabilmektedir.</p>
      <p class="content">App_Themes klas&ouml;r&uuml;  ASP.NET&rsquo;te temalar&#305; saklamak  i&ccedil;in  kullan&#305;l&#305;r. App_Themesklas&ouml;r&uuml; alt&#305;nda yer alan klas&ouml;rler de ASP.NET &ouml;zel klas&ouml;rleridir ve Themeklas&ouml;r&uuml; olarak adland&#305;r&#305;l&#305;r.Uygulamaya Themeklas&ouml;rleri  eklendikten  sonra  klas&ouml;r i&ccedil;ine SKINdosyalar&#305;, CSS dosyalar&#305; ve resimler eklenebilir.</p></td>
  </tr>
</table>
</body>
</html>
