<html>
<head>
<title></title>
<meta http-equiv="Content-Type" content="text/html; charset=8859-9">
<link rel="stylesheet" href="abstyle.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000" leftmargin="0" topmargin="0">
<table width="100%" border="0" cellpadding="15" cellspacing="0" height="612">
  <tr> 
    <td height="610" valign="top" width="100%"> 
      <p class="content"><span class="baslik">1.11 DURUM Y&Ouml;NET&#304;C&#304;S&#304;</span></p>
      <p class="imgdesc">Web  sayfalar&#305;  kullan&#305;l&#305;rken  istemci  ve  sunucu  aras&#305;ndaki  bilgi  al&#305;&#351;  veri&#351;i  HTTP protokol&uuml;  arac&#305;l&#305;&#287;&#305;yla  ger&ccedil;ekle&#351;tirilmektedir.  Geleneksel  web  programlamada,  istemci  ile sunucu aras&#305;ndaki ger&ccedil;ekle&#351;en bilgi al&#305;&#351; veri&#351;inde, istemciden sunucuya iletilen bilgiler kal&#305;c&#305; de&#287;ildir ve tekrar eri&#351;ilemez.Bilgiler kullan&#305;ld&#305;ktan sonra sunucu belle&#287;inden kald&#305;r&#305;l&#305;r.Geleneksel  web  programlamada  bu  s&#305;n&#305;rlamay&#305;  a&#351;mak  i&ccedil;in  ASP.NET  i&ccedil;erisinde istemci  bilgilerine  tekrar  ula&#351;&#305;labilmesi,  bu  bilgilerin  saklanmas&#305;  ve  ta&#351;&#305;nmas&#305;  i&ccedil;in  baz&#305; yap&#305;lar olu&#351;turulmu&#351;tur.Web uygulamalar&#305;nda veriler i&ccedil;in durum y&ouml;netimi sa&#287;layarakverilerin  sunucu  ya  da istemci  taraf&#305;ndansaklanmas&#305;n&#305;  sa&#287;layan  yap&#305;lara durum  y&ouml;netimi  nesneleriad&#305; verilmektedir. Bunlar</p>
      <p class="imgdesc">&nbsp;</p>
      <p class="imgdesc">QueryString nesnesi ile sayfalar aras&#305;nda ta&#351;&#305;nacak veri direk olarak URL arac&#305;l&#305;&#287;&#305;yla ta&#351;&#305;n&#305;r. Ta&#351;&#305;nacak olan veriler sayfan&#305;n adresinden sonra sorui&#351;areti (?) ba&#351;layan k&#305;s&#305;mda ta&#351;&#305;n&#305;r.  Bu  y&ouml;ntem  hem  kullan&#305;m  kolayl&#305;&#287;&#305;  hem  de  sunucuya  getirdi&#287;i  y&uuml;k&uuml;n  az  olmas&#305; nedeniyle &ccedil;ok&ccedil;a tercih edilmektedir.<br>
        <br>
        <br>
      </p>
      <img src="pics/derselement/Untitled-Diagram.png">
    </td>
  </tr>
</table>
</body>
</html>
