<html>
<head>
<title></title>
<meta http-equiv="Content-Type" content="text/html; charset=8859-9">
<link rel="stylesheet" href="abstyle.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000" leftmargin="0" topmargin="0">
<table width="100%" border="0" cellpadding="15" cellspacing="0" height="330">
  <tr> 
    <td height="324" valign="top" width="215"> 
      <p><img src="pics/derselement/20180111153153-n5196-hazir-web-sitesi-1.jpg" width="290" height="316"><br>
      </p>
      </td>
    <td valign="top" width="100%" height="324"> 
      <p class="content"><span class="baslik">1.7 ANASAYFA KULLANMA</span></p>
      <p class="content">Bir  web  sitesi  birden  fazla  sayfadan  olu&#351;ur.  Bu  sayfalarda  i&ccedil;erik  de&#287;i&#351;irken  her sayfada   tekrarlanan&ouml;geler  ve  &ouml;zellikler  vard&#305;r.  Web  sitesi  haz&#305;rlan&#305;rken  bir  &#351;ablon olu&#351;turarak  &#351;ablon  &uuml;zerinde  i&ccedil;erik  de&#287;i&#351;ikli&#287;i  ile  sayfalar  kolayl&#305;kla  haz&#305;rlanabilir.  Ancak sayfa  say&#305;s&#305;  artt&#305;k&ccedil;a  web  sitesinde  g&uuml;ncelleme  yapma  b&uuml;t&uuml;n  sayfalar&#305;n  tek  tek  elden ge&ccedil;irilerek de&#287;i&#351;tirilmesi anlam&#305;na gelmektedir. Bu durum zaman konusunda tasar&#305;mc&#305;lara &ccedil;e&#351;itli s&#305;k&#305;nt&#305;lara sebep olacakt&#305;r. CSS   (Cascading   Style   Sheets)sayfalar&#305;  kullan&#305;larak  web  sitesinin  sayfalar&#305;n&#305;n &ouml;zelliklerine do&#287;rudan m&uuml;dahale edilebilir. Bu&#351;ekilde sitenin t&uuml;m sayfalar&#305;n&#305;n stil &ouml;zellikleri tek  bir  yerden  kontrol  edilerek  kolayl&#305;kla g&uuml;ncelleme yap&#305;labilir (CSS konusuna ilerleyen konularda  yer  verilecektir). Ancak  t&uuml;m  sayfalarda  yer  alan  men&uuml;,resim,  logo  vb.  i&ccedil;erik de&#287;i&#351;ikli&#287;inde  bu  y&ouml;ntem  i&#351;e  yaramayacakt&#305;r.  Daha  &ouml;nceki  konularda  bahsedilen  Web Kullan&#305;c&#305;  Kontrolleri  ile  ASP.NET&rsquo;te  kullan&#305;larak  bu  duruma  &ccedil;&ouml;z&uuml;m  getirilmi&#351;tir. ASP.NET&rsquo;in  yeni  s&uuml;r&uuml;mleri  ile  birlikte  web  kullan&#305;c&#305;  kontrollerinin  yan&#305;nda Anasayfa (MasterPage)&ouml;zelli&#287;i eklenerek tasar&#305;mc&#305;lara b&uuml;y&uuml;k kolayl&#305;klar sa&#287;lanm&#305;&#351;t&#305;r.<br>
      </p>
    </td>
  </tr>
</table>
</body>
</html>
